#### Plan 📖: `success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-081269c722918cd19]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e3bc4719e9c35af9]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-09fdbd4f32d947863]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-04cfb40afd481c53b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b74f2b38a5604476]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-007c6800c89c7e0d4]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07cba67cfc0265366]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-008a5469dc3130a72]
module.vpc.aws_default_route_table.this: Refreshing state... [id=rtb-01abbba0bbf49bfe2]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-08f9741434520eea0]
module.vpc.aws_default_security_group.this: Refreshing state... [id=sg-03073a5c31ef0f700]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0ebea1e627f28adba]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b4c0f5e1d085c153]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d9d52b9e4accb5a0]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e3bc4719e9c35af91080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03d98e73613f8f3fa]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d6eac76f3bddac6c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fd1c408823f00f1e]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_default_route_table.this has changed
  ~ resource "aws_default_route_table" "this" {
        id                     = "rtb-01abbba0bbf49bfe2"
      + propagating_vgws       = []
        tags                   = {
            "ManagedBy" = "Terraform"
            "Name"      = "tgardiner-vpc-private"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0e3bc4719e9c35af9"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-007c6800c89c7e0d4"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "ManagedBy" = "Terraform"
            "Name"      = "tgardiner-vpc-public"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.openvpn.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "tgardiner-openvpn"
      + path        = "/"
      + role        = "tgardiner-openvpn"
      + tags        = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgardiner-openvpn"
        }
      + tags_all    = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgardiner-openvpn"
        }
      + unique_id   = (known after apply)
    }

  # module.openvpn.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tgardiner-openvpn"
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgardiner-openvpn"
        }
      + tags_all              = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgardiner-openvpn"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "tgardiner-openvpn"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "cloudwatch:PutMetricData",
                              + "ec2:DescribeVolumes",
                              + "ec2:DescribeTags",
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:DescribeLogGroups",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.openvpn.aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0b72496605b28e229"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgardiner-openvpn"
        }
      + tags_all                             = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgardiner-openvpn"
        }
      + tenancy                              = (known after apply)
      + volume_tags                          = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgardiner-openvpn"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.openvpn.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "tgardiner-openvpn"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 1194
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 1194
            },
        ]
      + name                   = "tgardiner-openvpn"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgardiner-openvpn"
        }
      + tags_all               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgardiner-openvpn"
        }
      + vpc_id                 = "vpc-081269c722918cd19"
    }

  # module.openvpn.random_shuffle.ec2_subnet_ids will be created
  + resource "random_shuffle" "ec2_subnet_ids" {
      + id           = (known after apply)
      + input        = [
          + "subnet-0b74f2b38a5604476",
          + "subnet-04cfb40afd481c53b",
          + "subnet-08f9741434520eea0",
        ]
      + result       = (known after apply)
      + result_count = 1
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tgardiner, Action: `pull_request`*